mediaMicroservices/wrk2/results/3phones/3phones_60s_r150.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 3020.418ms, rate sampling interval: 9093ms
  Thread calibration: mean lat.: 2741.890ms, rate sampling interval: 8413ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.19s     5.81s   25.40s    64.47%
    Req/Sec    43.60      8.31    48.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.35s 
 75.000%   16.66s 
 90.000%   22.84s 
 99.000%   25.40s 
 99.900%   26.17s 
 99.990%   26.33s 
 99.999%   26.33s 
100.000%   26.33s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3821.567     0.000000            1         1.00
    6135.807     0.100000          445         1.11
    7614.463     0.200000          890         1.25
    9166.847     0.300000         1337         1.43
   10821.631     0.400000         1780         1.67
   12353.535     0.500000         2225         2.00
   13197.311     0.550000         2446         2.22
   14073.855     0.600000         2669         2.50
   14950.399     0.650000         2891         2.86
   15851.519     0.700000         3114         3.33
   16678.911     0.750000         3337         4.00
   17235.967     0.775000         3449         4.44
   18022.399     0.800000         3558         5.00
   19202.047     0.825000         3671         5.71
   21299.199     0.850000         3780         6.67
   22347.775     0.875000         3892         8.00
   22609.919     0.887500         3950         8.89
   22839.295     0.900000         4003        10.00
   23232.511     0.912500         4058        11.43
   23527.423     0.925000         4114        13.33
   23740.415     0.937500         4176        16.00
   23822.335     0.943750         4199        17.78
   23953.407     0.950000         4226        20.00
   24100.863     0.956250         4254        22.86
   24330.239     0.962500         4282        26.67
   24444.927     0.968750         4309        32.00
   24625.151     0.971875         4322        35.56
   24772.607     0.975000         4336        40.00
   24887.295     0.978125         4352        45.71
   25001.983     0.981250         4364        53.33
   25182.207     0.984375         4381        64.00
   25247.743     0.985938         4386        71.11
   25280.511     0.987500         4393        80.00
   25346.047     0.989062         4399        91.43
   25444.351     0.990625         4407       106.67
   25591.807     0.992188         4414       128.00
   25657.343     0.992969         4417       142.22
   25722.879     0.993750         4420       160.00
   25739.263     0.994531         4423       182.86
   25853.951     0.995313         4427       213.33
   25935.871     0.996094         4432       256.00
   25935.871     0.996484         4432       284.44
   26001.407     0.996875         4435       320.00
   26001.407     0.997266         4435       365.71
   26034.175     0.997656         4437       426.67
   26083.327     0.998047         4439       512.00
   26116.095     0.998242         4440       568.89
   26132.479     0.998437         4441       640.00
   26132.479     0.998633         4441       731.43
   26148.863     0.998828         4442       853.33
   26165.247     0.999023         4444      1024.00
   26165.247     0.999121         4444      1137.78
   26165.247     0.999219         4444      1280.00
   26165.247     0.999316         4444      1462.86
   26214.399     0.999414         4445      1706.67
   26214.399     0.999512         4445      2048.00
   26247.167     0.999561         4446      2275.56
   26247.167     0.999609         4446      2560.00
   26247.167     0.999658         4446      2925.71
   26247.167     0.999707         4446      3413.33
   26247.167     0.999756         4446      4096.00
   26329.087     0.999780         4447      4551.11
   26329.087     1.000000         4447          inf
#[Mean    =    13190.758, StdDeviation   =     5814.153]
#[Max     =    26312.704, Total count    =         4447]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5299 requests in 1.00m, 0.93MB read
  Non-2xx or 3xx responses: 11
Requests/sec:     88.30
Transfer/sec:     15.90KB