mediaMicroservices/wrk2/results/3phones/3phones_60s_r50.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 127.944ms, rate sampling interval: 393ms
  Thread calibration: mean lat.: 122.245ms, rate sampling interval: 409ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   237.00ms  316.52ms   1.54s    88.63%
    Req/Sec    22.95      9.18    48.00     76.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  108.67ms
 75.000%  195.33ms
 90.000%  626.17ms
 99.000%    1.54s 
 99.900%    2.11s 
 99.990%    2.91s 
 99.999%    2.91s 
100.000%    2.91s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      48.415     0.000000            1         1.00
      71.359     0.100000          234         1.11
      79.423     0.200000          468         1.25
      86.015     0.300000          705         1.43
      94.143     0.400000          937         1.67
     108.671     0.500000         1173         2.00
     119.359     0.550000         1288         2.22
     131.967     0.600000         1404         2.50
     147.839     0.650000         1521         2.86
     165.759     0.700000         1639         3.33
     195.327     0.750000         1755         4.00
     222.975     0.775000         1814         4.44
     264.447     0.800000         1872         5.00
     323.583     0.825000         1931         5.71
     396.287     0.850000         1989         6.67
     497.407     0.875000         2048         8.00
     556.543     0.887500         2077         8.89
     626.175     0.900000         2106        10.00
     723.455     0.912500         2136        11.43
     792.575     0.925000         2165        13.33
     873.471     0.937500         2194        16.00
     952.319     0.943750         2209        17.78
    1032.703     0.950000         2223        20.00
    1087.487     0.956250         2238        22.86
    1146.879     0.962500         2253        26.67
    1204.223     0.968750         2267        32.00
    1259.519     0.971875         2275        35.56
    1296.383     0.975000         2282        40.00
    1323.007     0.978125         2289        45.71
    1371.135     0.981250         2297        53.33
    1424.383     0.984375         2304        64.00
    1486.847     0.985938         2308        71.11
    1509.375     0.987500         2312        80.00
    1533.951     0.989062         2315        91.43
    1558.527     0.990625         2320       106.67
    1563.647     0.992188         2323       128.00
    1573.887     0.992969         2324       142.22
    1585.151     0.993750         2326       160.00
    1606.655     0.994531         2328       182.86
    1657.855     0.995313         2330       213.33
    1678.335     0.996094         2331       256.00
    1723.391     0.996484         2332       284.44
    1726.463     0.996875         2333       320.00
    1754.111     0.997266         2334       365.71
    1763.327     0.997656         2335       426.67
    1783.807     0.998047         2336       512.00
    1783.807     0.998242         2336       568.89
    1805.311     0.998437         2337       640.00
    1805.311     0.998633         2337       731.43
    2113.535     0.998828         2338       853.33
    2113.535     0.999023         2338      1024.00
    2113.535     0.999121         2338      1137.78
    2330.623     0.999219         2339      1280.00
    2330.623     0.999316         2339      1462.86
    2330.623     0.999414         2339      1706.67
    2330.623     0.999512         2339      2048.00
    2330.623     0.999561         2339      2275.56
    2912.255     0.999609         2340      2560.00
    2912.255     1.000000         2340          inf
#[Mean    =      237.002, StdDeviation   =      316.518]
#[Max     =     2910.208, Total count    =         2340]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2862 requests in 1.00m, 515.96KB read
  Non-2xx or 3xx responses: 10
Requests/sec:     47.69
Transfer/sec:      8.60KB